switched to mermaid
